# InvalidSketch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridChainSketchFailures..::..InvalidSketch Property
BuiltInFailures..::..GridChainSketchFailures Class See Also
---
Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GridChainSketchFailures Class
Autodesk.Revit.DB Namespace